#include <iostream>

// ========================================================================= //
//  【モンスター】ピカチュウ.
// ========================================================================= //
class CPicachu
{
public:

    CPicachu();
    virtual ~CPicachu(); // デストラクタには virtual を付ける.

    void Attack();

private:

    int mLevel;         // レベル.
    int mHitPoint;      // HP.
    int mAttackPoint;   // 攻撃.
    int mDefensePoint;  // 防御.
};

// ------------------------------------------------------------------------- //
//  コンストラクタ.
// ------------------------------------------------------------------------- //
CPicachu::CPicachu()
    : mLevel( 1 ), mHitPoint( 35 ), mAttackPoint( 55 ), mDefensePoint( 40 )
{
    std::cout << "ピカチュウ誕生\n";

    std::cout << mLevel << "レベル\n";        
    std::cout << mHitPoint << "HP\n";
    std::cout << mAttackPoint << "攻撃\n";
    std::cout << mDefensePoint << "防御\n";
}

// ------------------------------------------------------------------------- //
//  デストラクタ.
// ------------------------------------------------------------------------- //
CPicachu::~CPicachu()
{
}

// ------------------------------------------------------------------------- //
//  攻撃.
// ------------------------------------------------------------------------- //
void CPicachu::Attack()
{
    std::cout << "10万ボルト！\n";
}

// ------------------------------------------------------------------------- //
//  メイン.
// ------------------------------------------------------------------------- //
int main()
{
    CPicachu picachu;

    picachu.Attack();
}
